tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "git"
brew "gh"
brew "glab"
brew "git-credential-manager"
brew "openssl@3"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "ruby-build"
brew "pipx"
brew "asdf"
brew "go"
brew "rustup-init"
brew "volta"
brew "nvm"
brew "colima"
brew "podman"
brew "mas"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "ansible"
brew "chezmoi"

cask "iterm2"
cask "docker"
cask "podman-desktop"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "raycast"
cask "alfred"
cask "hammerspoon"
cask "tableplus"
cask "postico"
cask "mongodb-compass"
cask "charles"
cask "proxyman"
cask "wireshark"
cask "utm"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

