# 版本控制
brew "git"
brew "gh"
brew "glab"
cask "fork"

# 基础依赖
brew "openssl@3"

# 语言运行时管理
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "ruby-build"
brew "pipx"
brew "go"
brew "rustup-init"
brew "volta"

# 容器
# podman-desktop 自带 podman CLI，无需单独安装

# Shell 与终端
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# 工具
brew "mas"
brew "ansible"
brew "chezmoi"

# 终端
cask "iterm2"

# 容器 GUI
cask "podman-desktop"

# 编辑器
cask "visual-studio-code"
cask "jetbrains-toolbox"

# 浏览器
cask "google-chrome"

# 效率工具
cask "raycast"
cask "hammerspoon"

# 数据库客户端
cask "tableplus"
cask "postico"
cask "mongodb-compass"

# 网络调试
cask "proxyman"
cask "wireshark"

# 虚拟化
cask "utm"

# 字体
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"

